# PartmakerParamDivisionGap Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..PartmakerParamDivisionGap Property
ParameterTypeId Class See Also
---
"Gap"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId PartmakerParamDivisionGap { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PartmakerParamDivisionGap As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ PartmakerParamDivisionGap {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace